{"post_link": "http://web.archive.org/web/20220309070018/https://ghanaxtra.com/2021/12/teacher-kwadwo-provides-20-solid-responses-to-rubbish-dismissal.html", "post": ["Black Stars Coach, Otto Addo, has named a strong starting eleven for the FIFA World Cup Qatar 2022 playoffs against Nigeria at the Baba Yara Sports stadium.", "Ghana hosts the 1st leg this evening at the Baba Yara Sports stadium before traveling to Abuja for the 2nd leg on Tuesday, March 29, 2022.", "It is a 4:4:2 formation with a lot of variations.", "The  Baba Yara Sports Stadium is filled up to capacity for the encounter.", "Check the lineup below", "", "Call our Editor on 0209391902 or click here and inform us via Whatsapp. You could equally email your stories or articles to [email protected] and we'll surely put them online", "", "The 9-month pregnant woman, Josephine Panyin Mensah, who went missing in Takoradi in the Western Region has been rescued at Axim, GhanaXtra.Com can report.", "She was found after a collaborative effort between security agencies and some members of the public.", "She has reportedly been sent to the Axim Government Hospital for medical care and attention.", "Josephine Panyin Mensahwent missing on Thursday, September 16,  after she went for a dawn walk in Takoradi.", "The police immediately began a search for her after a report was made to the police by her husband, Michael Simmons", "It later emerged that an unknown person had placed a call to the family demanding a ransom.", "Call our Editor on 0209391902 or click here and inform us via Whatsapp. You could equally email your stories or articles to [email protected] and we'll surely put them online", "Due to a planned power outage on Friday, 1/14, between 8am-1pm PST, some services may be impacted.", "\n          Search the history of over 800 billion\n          web pages\n          on the Internet.\n        ", "Capture a web page as it appears now for use as a trusted citation in the future.", "Please enter a valid web address", "The Wayback Machine has not archived that URL.", "Click here to search for all archived pages under\n      http://ghanaxtra.com/2018/06/.\n    ", "\n          The Wayback Machine is an initiative of the\n          Internet Archive,\n          a 501(c)(3) non-profit, building a digital library of\n          Internet sites and other cultural artifacts in digital form.\n          Other projects include\n          Open Library &\n          archive-it.org.\n        ", "\n          Your use of the Wayback Machine is subject to the Internet Archive's\n          Terms of Use.\n        ", "", "A dismissed employee of the Ghana Education Service(GES), Micheal Owusu Afriyie, popularly known as Teacher Kwadwo has responded to his sack.", "Teacher Kwadwo was dismissed in a letter dated October 27, 2021, and signed by Deputy Director-General, Mr. Anthony Boateng, on three counts.", "He was found guilty of refusing to prepare lesson notes and submitting same for vetting, absenting himself from school for a period of 55 days without permission, and exhibiting a high level of insubordination towards the District Director of Education and the School Improvement Support Officer(SISO) for his school.", "According to management, these conducts are serious, unprofessional, and unethical and therefore rejected the earlier recommendation of the District Education Committee that he should be re-assigned to a different school.", "But in a characteristic fashion, the comedian cum professional teacher has given a blow by blow account of what can be deemed as the “true” inside story.", "Read his full response below", "PRESS STATEMENT by Teacher Kwadwo", "Sunday, December 19, 2021.", "On Friday, 17th December 2021, I received a letter from the Regional Education Office informing me that the Management has taken a decision to terminate my appointment from the Ghana Education Service.", "According to the letter, the reasons for my dismissal, relate to", "1. My absence without permission for 55 days from school.", "2. My failure to prepare and submit lesson notes for vetting by the headmaster", "3. My failure to respond to queries served on me by the Headmaster and the School Support Officer, as evidence of my gross insubordination.", "On Sunday 19th December 2021, the said letter was, contrary to my protected privacy interests, and the Code of Conduct of the GES released into the public domain, by persons working for the GES, through their surrogates.", "I am still considering my legal options against the GES and shall speak to that at a latter time. However, I issue this statement to address the allegations contained in the letter in the interest of the urgent national debate that must happen if we are all truly committed to fixing our broken educational system", "Absence without Permission", "1. Contrary to the claims by the GES that, I was absent from School for 55 days without permission, I state categorically that this information is false and misleading.", "2. In fact, during the proceedings, the Committee established that on the relevant occasions, I had at all times received permission from the head of my institution.", "3. The Committee heard from colleague teachers and established that in fact, the head of my institution put in place a flexible working arrangement that enabled me to teach, while taking Fridays off, to enable me seek sponsorship for the School and the District. All those days was covered by a substitute teacher.", "4. The Committee also established that the headmaster actually informed the entire teaching Staff that because I had taken on the task of seeking support and sponsorship for the School, and that this was yielding results, had he had decided to make it flexible for me to able to combine my official teaching duties, with my social responsibilities for the school and the district. I was encouraged to do these activities and made to understand that acting as a social ambassador for my school was expected from teachers and a good example to follow.", "5. The Committee took issue with the fact that the permission I had obtained was oral and not written. However, the GES Code of Conduct, which was drawn to their attention clearly specifies that permission need not be only written, it can also be verbal. In fact, the GES Code of Conduct only insists on a written permission, when a Staff is seeking to travel outside of the Country. (See Rule 3.15)", "6. I challenge all teachers in this Country, to state that they have never received an oral permission from their headteachers to be absent from school at any time.", "7. I find that this attempt to reinterpret the Code of Conduct in order to ground the motivated decision to dismiss me, smacks of discrimination and confirms my suspicion that I have been victimized for my criticisms of GES through", "8. I note that the Management claims that in proposing that I be dismissed from the Service they have into consideration the fact that I have taken several steps which have brought in significant sponsorship support for the School and the entire district. I find it however bizarre, that they will acknowledge the fruits that the special dispensation by the headteacher allowed me to secure for the district, while recommending that I be dismissed. So how was my industry to go above and beyond my duties as a teacher taken into account in order to dismiss me?", "Failure to Submit Lesson Notes", "1. Management claims that I refused to prepare and submit lesson notes to the headmaster for vetting.", "2. This information is also untrue and skewed to justify a baseless decision.", "3. In fact, the Committee found that I had at all times typed and printed my lesson notes which I presented to the Headmaster. Except that my headmaster continued to insist that the lesson notes must be handwritten and refused to accept printed lesson notes until the past term.", "4. It is thus not true that the lesson notes were not prepared and submitted.", "5. In fact, the major disagreement was whether the GES Code of Conduct requires that lesson notes be handwritten and cannot be typed and printed.", "6. I note that several schools in the District and across Ghana, accept for teachers to type and print their lesson notes; and that there is no uniform practice across the country. It seems both bizarre and disingenuous for Management to fail to demonstrate which part of the GES Code of Conduct insists that lesson notes must be handwritten lesson. Also, I challenge teachers to speak up publicly whether their schools all insist on handwriting lesson notes.", "7. In any event, what purpose does it serve to bar teachers from typing and printing their lesson notes, while at the same time procuring and surcharging teachers with laptops.", "8. What is the purpose of the laptops? That they should not be incorporated in teaching?", "Failure to respond to queries served on me by the Headmaster and the School Support Officer", "1. I deny the claim that I was insubordinate and reiterate that I did not disobey, disregard or willfully default in carrying out any lawful instruction, reasonable order given by any person, Committee or Board, having authority to do so.", "2. It is not true that I was grossly insubordinate and had failed to respond to queries served on me.", "3. In fact, this issue was not part of the charges I was invited to respond to. I am then surprised to see this issue raised as part of the reasons for dismissing me. The Committee did not provide me with any evidence to support this claim.", "4. As I understand, it offends my rights to fair hearing to be dismissed on charges that I have not been invited with sufficient clarity to respond to.", "1. I encourage Ghanaians to be less pliable and to avoid swallowing every statement our public institutions make hook-line-and-sinker. Let us make our decisions by being willing to read between the lines and by examining the context of steps taken by Ghanaian institutions. If we do that, we can then be better placed to hold our institutions accountable.", "2. If we want to protect whistleblowers and support public servants who are willing to be bold in speaking out against injustice, then we must be particularly willing to go beyond official reasons and placid language, that misdirects us to look the other way, when injustice occurs.", "3. When the system wants to get you; the system will get you. It does not matter if you are in a constitutionally protected office. We know this all too well; yet we make the same mistakes again when we accept official narratives all too willingly.", "4. In my life as a teacher, I am yet to see a staff who was victimized and dismissed for demanding better for their school and district, and who was given a dismissal letter that stated that “Mr X was dismissed for making GES unpopular.”", "5. Official letters do not provide confirmation of victimization. If we want our teachers to be bolder in exposing rot, we need to be more analytical and more probing. Wholesale reliance on official narratives is not how we will #FixGES or any broken system.", "Call our Editor on 0209391902 or click here and inform us via Whatsapp. You could equally email your stories or articles to [email protected] and we'll surely put them online"], "title": "Teacher Kwadwo Provides 20 Solid Responses To Rubbish Dismissal", "author": "Frank A. Hartmann, Managing Editor"}